{
  "projects": [
    {
      "title": "AI Care Website",
      "description": "Developed a full-stack web platform for AI-assisted elderly care, featuring real-time image analysis using OpenCV for environment awareness. Implemented a Flask backend with modular APIs and a responsive Bootstrap frontend delivering interactive health-education content.",
      "languages": ["Python", "JavaScript", "HTML", "CSS"],
      "tools": ["Flask", "OpenCV", "Bootstrap", "SQLite"],
      "url": "https://github.com/TsengYuanChe/AI_care_website"
    },
    {
      "title": "Financial Report Crawler",
      "description": "Automated crawler system for downloading financial statements from TWSE, built to streamline analysts’ data-preparation workflow. Utilizes Selenium for dynamic page interaction and BeautifulSoup for structured data extraction, enabling fully automated retrieval and organization of report files.",
      "languages": ["Python"],
      "tools": ["Selenium", "BeautifulSoup", "Webdriver"],
      "url": "https://github.com/TsengYuanChe/Financial_report_crawler"
    },
    {
      "title": "yt_pod",
      "description": "Content integration tool that automatically retrieves, transcribes, and summarizes updates from YouTube channels and podcast feeds. Built to unify multi-platform media into a structured dataset, enabling faster review and downstream analysis.",
      "languages": ["Python"],
      "tools": ["YouTube API", "Podcast API", "Whisper", "GPT-3"],
      "url": "https://github.com/TsengYuanChe/yt_pod_crawler"
    },
    {
      "title": "Enterprise System Development @ eZoom",
      "description": "End-to-end development for large-scale enterprise systems, including frontend modules, backend services, and database architecture. Worked across full-stack layers, implementing .NET 8/C# APIs, FastAPI microservices, Vue frontend interfaces, and schema design for MSSQL/PostgreSQL. Built CI/CD pipelines, automated deployments, and managed production environments on Windows Server + IIS.",
      "languages": ["C#", "Python", "JavaScript", "SQL"],
      "tools": [".NET 8", "Vue 3", "FastAPI", "MSSQL", "PostgreSQL"],
      "url": null
    }
  ]
}